# data/constants.py

CAT_STATUSES = {
    1: "Шерстяная личинка 🐛",
    2: "Картонный рыцарь 📦",
    3: "Помощник Мяулера 🐾",
    4: "Тыгыдык-стажер ⚡",
    5: "Бригадир хвостов 😼",
    6: "Диванный эксперт 🛋️",
    7: "Смотрящий за миской 🔥",
    8: "Пушистый авторитет 🕶️",
    9: "Дон Мяулеоне 👑"
}

CAT_CLASSES = {
    "none": "Без класса",
    "warrior": "Кот-Обжорыч 🛡",
    "thief": "Кот-Гопник 👤",
    "support": "Кошечка-Ботаник 🎶",
    "assassin": "Кот-Ниндзя 🗡"
}

# Сюда же потом пойдут описания артефактов и ресурсов
